---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailingsError
source: html/fbb1043c-c83c-f6c5-5229-02e849d5d43a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailingsError Property

Can't create Railings.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadRailingsError { get; }
```